# SetPatternData

## Description
Set current choice and colors for the pattern popup dialog control.

```pascal
PROCEDURE SetPatternData(
				dialogID     : LONGINT;
				itemID       : LONGINT;
				patternIndex : INTEGER;
				foreColor    : INTEGER;
				backColor    : INTEGER);
```

```python

def vs.SetPatternData(dialogID, itemID, patternIndex, foreColor, backColor):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT||
|itemID|LONGINT||
|patternIndex|INTEGER||
|foreColor|INTEGER||
|backColor|INTEGER||

## Version
Availability: from VectorWorks12.0
## Category
* Dialogs - Modern